### Report for reports_generator on environment: dev

#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
<details><summary>Initialization Output</summary>

```

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 6.0"...
- Installing hashicorp/aws v6.27.0...
- Installed hashicorp/aws v6.27.0 (signed by HashiCorp)
Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

```

</details>

#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan (17 to add, 0 to change, 0 to destroy)</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.reports_generator_output_buckets_write_access will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "reports_generator_output_buckets_write_access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::prm-gp2gp-notebook-data-dev/*",
              + "arn:aws:s3:::prm-gp2gp-reports-dev/*",
            ]
          + sid       = "WriteObjects"
        }
    }

  # aws_cloudwatch_dashboard.data_pipeline will be created
  + resource "aws_cloudwatch_dashboard" "data_pipeline" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = (sensitive value)
      + dashboard_name = "dev-registrations-data-pipeline-reports-generator"
      + id             = (known after apply)
      + region         = "eu-west-2"
    }

  # aws_ecs_task_definition.reports_generator will be created
  + resource "aws_ecs_task_definition" "reports_generator" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (sensitive value)
      + family                   = "dev-reports-generator"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + region                   = "eu-west-2"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "ApplicationRole"     = "AwsEcsTaskDefinition"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-reports-generator"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                 = {
          + "ApplicationRole"     = "AwsEcsTaskDefinition"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-reports-generator"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_policy.notebook_data_bucket_read_access will be created
  + resource "aws_iam_policy" "notebook_data_bucket_read_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "prm-gp2gp-notebook-data-dev-read"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prm-gp2gp-notebook-data-dev"
                      + Sid      = "ListBucket"
                    },
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::prm-gp2gp-notebook-data-dev/*"
                      + Sid      = "ReadObjects"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.reports_generator_output_buckets_write_access will be created
  + resource "aws_iam_policy" "reports_generator_output_buckets_write_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "reports-generator-output-buckets-dev-write"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.reports_generator will be created
  + resource "aws_iam_role" "reports_generator" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for reports generator ECS task"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-registrations-reports-generator"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.reports_generator_notebook_data_bucket_read_access will be created
  + resource "aws_iam_role_policy_attachment" "reports_generator_notebook_data_bucket_read_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-registrations-reports-generator"
    }

  # aws_iam_role_policy_attachment.reports_generator_output_buckets_write_access will be created
  + resource "aws_iam_role_policy_attachment" "reports_generator_output_buckets_write_access" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-registrations-reports-generator"
    }

  # aws_iam_role_policy_attachment.reports_generator_transfers_input_bucket_read_access will be created
  + resource "aws_iam_role_policy_attachment" "reports_generator_transfers_input_bucket_read_access" {
      + id         = (known after apply)
      + policy_arn = (sensitive value)
      + role       = "dev-registrations-reports-generator"
    }

  # aws_s3_bucket.reports_generator will be created
  + resource "aws_s3_bucket" "reports_generator" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prm-gp2gp-reports-dev"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "ApplicationRole"     = "AwsS3Bucket"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-output-reports"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all                    = {
          + "ApplicationRole"     = "AwsS3Bucket"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-output-reports"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_acl.reports_generator will be created
  + resource "aws_s3_bucket_acl" "reports_generator" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-2"

      + access_control_policy (known after apply)
    }

  # aws_s3_bucket_ownership_controls.reports_generator will be created
  + resource "aws_s3_bucket_ownership_controls" "reports_generator" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-2"

      + rule {
          + object_ownership = "ObjectWriter"
        }
    }

  # aws_s3_bucket_public_access_block.reports_generator will be created
  + resource "aws_s3_bucket_public_access_block" "reports_generator" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "eu-west-2"
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_versioning.reports_generator will be created
  + resource "aws_s3_bucket_versioning" "reports_generator" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_s3_object.report_metadata_example will be created
  + resource "aws_s3_object" "report_metadata_example" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/csv"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "report_metadata_example.csv"
      + kms_key_id             = (known after apply)
      + metadata               = {
          + "config-cutoff-days"              = "0"
          + "report-name"                     = "TRANSFER_DETAILS_BY_HOUR"
          + "reporting-window-end-datetime"   = "2024-08-01T00:00:00+00:00"
          + "reporting-window-start-datetime" = "2024-07-31T00:00:00+00:00"
          + "send-email-notification"         = "True"
          + "technical-failures-percentage"   = "1.78"
          + "total-technical-failures"        = "213"
          + "total-transfers"                 = "11101"
        }
      + region                 = "eu-west-2"
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_ssm_parameter.reports_generator_iam_role_arn will be created
  + resource "aws_ssm_parameter" "reports_generator_iam_role_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/registrations/dev/data-pipeline/reports-generator/iam-role-arn"
      + region         = "eu-west-2"
      + tags           = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-reports-generator-iam-role-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all       = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-reports-generator-iam-role-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.reports_generator_output_bucket_name will be created
  + resource "aws_ssm_parameter" "reports_generator_output_bucket_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/registrations/dev/data-pipeline/reports-generator/output-bucket-name"
      + region         = "eu-west-2"
      + tags           = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-reports-generator-output-bucket-name"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all       = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-reports-generator-output-bucket-name"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # aws_ssm_parameter.reports_generator_task_definition_arn will be created
  + resource "aws_ssm_parameter" "reports_generator_task_definition_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/registrations/dev/data-pipeline/reports-generator/task-definition-arn"
      + region         = "eu-west-2"
      + tags           = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-reports-generator-task-definition-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tags_all       = {
          + "ApplicationRole"     = "AwsSsmParameter"
          + "BackupLocal"         = "False"
          + "BackupRemote"        = "False"
          + "CostCentre"          = "P0688/04"
          + "CreatedBy"           = "gp2gp-reporting-infrastructure"
          + "Customer"            = "NHS D"
          + "DataType"            = "None"
          + "Environment"         = "dev"
          + "Name"                = "dev-reports-generator-task-definition-arn"
          + "OnOffPattern"        = "AlwaysOn"
          + "Owner"               = "Candice Moore"
          + "Programme"           = "GP IT Futures"
          + "Project"             = "Patient Record Migration"
          + "ProjectType"         = "Public beta"
          + "PublicFacing"        = "N"
          + "ServiceCategory"     = "Bronze"
          + "TagVersion"          = "1"
          + "Team"                = "Registrations"
          + "data_classification" = "1"
          + "envtype"             = "dev"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.

```

</details>